app/views/startups/show.html.erb

SELECT `bpsubsections`.* FROM `bpsubsections` WHERE (`bpsubsections`.bpsection_id = 1)
---
          </div>
          <% sec.bpsubsections.each do |subsec| %>