app/controllers/emails_controller.rb

SELECT `emails`.* FROM `emails` ORDER BY created_at desc
---
  def index
    @emails = Email.all(:order => 'created_at desc')

INSERT INTO `emails` (`updated_at`, `message`, `to`, `subject`, `created_at`, `from`) VALUES ('2012-06-11 18:33:10', '80 days around the world, we\'ll find a pot of gold just sitting where the rainbow\'s ending. Time - we\'ll fight against the time, and we\'ll fly on the white wings of the wind. 80 days around the world, no we won\'t say a word before the ship is really back. Round, round, all around the world. Round, all around the world. Round, all around the world. Round, all around the world.\n\nUlysses, Ulysses - Soaring through all the galaxies. In search of Earth, flying in to the night. Ulysses, Ulysses - Fighting evil and tyranny, with all his power, and with all of his might. Ulysses - no-one else can do the things you do. Ulysses - like a bolt of thunder from the blue. Ulysses - always fighting all the evil forces bringing peace and justice to all.\n\nBen Hall', 'benhall2121@yahoo.com', 'too cool for school', '2012-06-11 18:33:10', 'benhall2121@skrittle.com')
---
  def add_email
    @emails = Email.new(params[:email])
    @emails.save