app/controllers/faqs_controller.rb

SELECT `faqs`.* FROM `faqs`
---
  def index
    @faqs = Faq.all

SELECT `faqs`.* FROM `faqs` WHERE `faqs`.`id` = 1 LIMIT 1
---
  def show
    @faq = Faq.find(params[:id])

SELECT `faqs`.* FROM `faqs` WHERE `faqs`.`id` = 2 LIMIT 1
---
  def edit
    @faq = Faq.find(params[:id])

INSERT INTO `faqs` (`answer`, `question`, `updated_at`, `created_at`) VALUES ('You are! You are! You are! You are! You are! You are! You are! You are! You are! You are! ', 'How is the coolest person in the world?', '2012-06-11 17:01:17', '2012-06-11 17:01:17')
---
  def create
    @faq = Faq.new(params[:faq])

    respond_to do |format|
      if @faq.save

SELECT `faqs`.* FROM `faqs` WHERE `faqs`.`id` = 2 LIMIT 1
---
  def update
    @faq = Faq.find(params[:id])

SELECT `faqs`.* FROM `faqs` WHERE `faqs`.`id` = 2 LIMIT 1
DELETE FROM `faqs` WHERE `faqs`.`id` = 2
---
  def destroy
    @faq = Faq.find(params[:id])
    @faq.destroy