app/controllers/password_resets_controller.rb

SELECT 1 FROM `users` WHERE (`users`.`email` = BINARY 'benhall2121@yahoo.com') AND (`users`.id <> 7) LIMIT 1
---
  def create
    user = User.find_by_email(params[:email])

SELECT `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'zAKRc6rL8u21v4mKLSIUCQ==' LIMIT 1
---
  def edit
    @user = User.find_by_password_reset_token!(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'zAKRc6rL8u21v4mKLSIUCQ==' LIMIT 1
UPDATE `users` SET `updated_at` = '2012-05-18 22:07:12', `password_salt` = '$2a$10$2Os64vCm3Q2.SVvYUcbYLe', `password_hash` = '$2a$10$2Os64vCm3Q2.SVvYUcbYLeEVwik6.qr9FwK48Erq/2KXPDyH0FpPa' WHERE `users`.`id` = 7
---
  def update
    @user = User.find_by_password_reset_token!(params[:id])
    if @user.password_reset_sent_at < 2.hours.ago
      redirect_to new_password_reset_path, :alert => "Password reset has expired."
    elsif @user.update_attributes(params[:user])