app/controllers/sections_controller.rb

SELECT `sections`.* FROM `sections` WHERE (page_type = 'about') ORDER BY created_at desc LIMIT 1
---
  def about
    @section = Section.find(:first, :conditions => ['page_type = ?', 'about'], :order => 'created_at desc')

SELECT `sections`.* FROM `sections`
---
  def index
    @sections = Section.all

SELECT `sections`.* FROM `sections` WHERE `sections`.`page_type` = 'about' LIMIT 1
---
  def edit
    if !params[:page_type].nil?
      @section = Section.find_by_page_type(params[:page_type])

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 3 LIMIT 1
UPDATE `sections` SET `content` = 'This is how we roll. Check us out just rolling along.', `updated_at` = '2012-06-12 01:05:26' WHERE `sections`.`id` = 3
---
  def update
    @section = Section.find(params[:id])

    respond_to do |format|
      if @section.update_attributes(params[:section])