app/controllers/startups_controller.rb

  def index
    @startups = Startup.all
---
SELECT `startups`.* FROM `startups`