app/controllers/startups_controller.rb

SELECT COUNT(*) FROM `startups` WHERE (startup_name LIKE '%c%' OR brief_description LIKE '%c%')
SELECT `startups`.* FROM `startups` WHERE (startup_name LIKE '%c%' OR brief_description LIKE '%c%') ORDER BY created_at desc LIMIT 2 OFFSET 0
---
  def index
    #.order(sort_column + " " + sort_direction)
    @startups = Startup.search(params[:search]).order('created_at desc').paginate(:per_page => 12, :page => params[:page])

SELECT `startups`.* FROM `startups` WHERE `startups`.`username` = 'AwesomeGroup' LIMIT 1
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
SELECT `descriptions`.* FROM `descriptions` WHERE (`descriptions`.startup_id = 9) LIMIT 1
SELECT `bpsections`.* FROM `bpsections` WHERE (`bpsections`.startup_id = 2)
---
  def show
    if params[:startup_usersname]
     @startup = Startup.find_by_username(params[:startup_usersname])
    else
      @startup = Startup.find(params[:id])
    end

    @amount_raised = transaction_amount('donation', @startup.id)
    @percent_raised = ((@amount_raised / @startup.donation_amount)*100)

    if @percent_raised.infinite? || @percent_raised > 100 || @percent_raised.nan?
      @percent_raised = 100
    else
      @percent_raised = @percent_raised.to_i
    end

    @amount_to_go = @startup.donation_amount.to_f - @amount_raised.to_f

    if @amount_to_go < 0
      @amount_to_go = 0
    end



    @descriptions = @startup.descriptions.find(:all)
    @bpsections = @startup.bpsections.find(:all)

SELECT `users`.* FROM `users` WHERE (user_type == "User")
---
  def new
    @startup = Startup.new
    @users = User.find(:all, :conditions => ['user_type = "User"'])

SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE (user_type = "User")
---
  def edit
    @startup = Startup.find(params[:id])
    @users = User.find(:all, :conditions => ['user_type = "User"'])

SELECT `users`.* FROM `users` WHERE (user_type = "User")
INSERT INTO `startups` (`email`, `brief_description`, `updated_at`, `address`, `startup_logo_file_size`, `username`, `zip`, `user_id`, `created_at`, `startup_logo_content_type`, `city`, `state`, `startup_logo_file_name`, `startup_name`, `startup_logo_updated_at`) VALUES ('another@gmail.com', 'Just a second startuop to test', '2012-05-22 00:22:57', '444 west st', 2431062, 'AnotherStartup', '85295', 10, '2012-05-22 00:22:57', 'image/jpeg', 'gilbert', 'AZ', 'IMG_0556.JPG', 'AnotherStartup', '2012-05-22 00:22:53')
---
  def create
    @users = User.find(:all, :conditions => ['user_type = "User"'])
    @startup = Startup.new(params[:startup])

    respond_to do |format|
      if @startup.save

SELECT `users`.* FROM `users` WHERE (user_type = "User")
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 1 LIMIT 1
UPDATE `startups` SET `startup_logo_updated_at` = '2012-05-22 00:23:17', `updated_at` = '2012-05-22 00:23:28', `startup_logo_file_name` = 'Techiepalooza_Flyer.pdf', `startup_logo_content_type` = 'application/pdf', `startup_logo_file_size` = 73652 WHERE `startups`.`id` = 1
---
  def update
    @users = User.find(:all, :conditions => ['user_type = "User"'])
    @startup = Startup.find(params[:id])

    respond_to do |format|
      if @startup.update_attributes(params[:startup])

SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 1 LIMIT 1
DELETE FROM `startups` WHERE `startups`.`id` = 1
---
  def destroy
    @startup = Startup.find(params[:id])
    @startup.destroy