app/controllers/transactions_controller.rb

  def new_transaction
    @transaction = Transaction.new(params[:transaction])
    @transaction.user_id = current_user.id

    @transaction.save
---
INSERT INTO `transactions` (`user_id`, `amount`, `startup_id`, `created_at`, `transaction_type`, `updated_at`) VALUES (7, '123.98', 9, '2012-06-22 20:48:59', 'donation', '2012-06-22 20:48:59')

  def show
    @transaction = Transaction.find(params[:id])
---
SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`id` = 51 LIMIT 1

  def create
    @transaction = Transaction.new(params[:transaction])

    respond_to do |format|
      if @transaction.save_and_make_charge
---
INSERT INTO `transactions` (`transaction_type`, `charge_id`, `user_id`, `startup_id`, `amount`, `updated_at`, `created_at`) VALUES ('donation', 'ch_iDOsh2aKib8pnE', 7, 8, '4.56', '2012-06-25 23:45:32', '2012-06-25 23:45:32')