app/controllers/users_controller.rb

  def home
    #@startups = Startup.find(:all, :conditions => ['active = ?', true], :limit => 20)
    @startups = Startup.find(:all, :limit => 20)
---
SELECT `startups`.* FROM `startups` WHERE (active = 1) LIMIT 20

  def index
    if(params[:user_type])
      @users = User.find(:all, :conditions => ["user_type = (?)", params[:user_type]])
    else
      @users = User.all
---
SELECT `users`.* FROM `users` WHERE (user_type = ('Contributor'))
SELECT `users`.* FROM `users`

  def edit
    if admin?
      @user = User.find(params[:id])
    else
      @user = User.find(current_user.id)
    end

    @transactions = @user.transactions.find(:all, :select => ('startup_id, SUM(amount) as amount'), :order => 'created_at desc', :group => 'startup_id')
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 11 LIMIT 1
SELECT SUM(`transactions`.`amount`) AS sum_id FROM `transactions` WHERE (transaction_type = 'donation' AND startup_id = 2)
SELECT startup_id, SUM(donation_amount) as donation_amount FROM `transactions` WHERE (`transactions`.user_id = 7) GROUP BY startup_id ORDER BY created_at desc

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `password_reset_sent_at`, `password_reset_token`, `password_hash`, `photo_content_type`, `updated_at`, `email`, `auth_token`, `active`, `admin`, `user_type`, `password_salt`, `photo_file_size`, `photo_updated_at`, `photo_file_name`) VALUES ('2012-06-20 00:23:37', NULL, NULL, '$2a$10$mUz0qWoBOtwO01VjOh9NVOhGXa8kNsKEbUoQQVrn849vV4B7/0WTe', NULL, '2012-06-20 00:23:37', 'awesomeDude@gmail.com', 'N9Bw2ZuEgv-UncVcGzGfvA==', 1, NULL, 'Contributor', '$2a$10$mUz0qWoBOtwO01VjOh9NVO', NULL, NULL, NULL)

  def update
    if admin?
      @user = User.find(params[:id])
    else
      @user = User.find(current_user.id)
    end

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 11 LIMIT 1
UPDATE `users` SET `photo_file_size` = 255862, `user_type` = 'Contributor', `photo_content_type` = 'image/jpeg', `photo_file_name` = 'PigGirl.jpg', `updated_at` = '2012-06-20 00:17:29', `photo_updated_at` = '2012-06-20 00:17:28' WHERE `users`.`id` = 7

  def card_for_user
    @user = User.find(current_user.id)
    @user.stripe_card_token = params[:stripe_card_token]

    #@user.last_four_cc = params[:card_number][-4,4]

    if @user.save_with_payment
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
UPDATE `users` SET `last_four_cc` = '4242424242424242', `updated_at` = '2012-06-25 22:57:59', `stripe_customer_token` = 'cus_Jfn1U6SD4HBYNJ' WHERE `users`.`id` = 7